<html>
<head>
 <title>Seedy Events October 1999 - February 2000   - Seeds of Diversity Canada </title> 
</head>
<body>

<center>
<table width="660" height="131" cellspacing="0" cellpadding="0" border="0">
<tr><td><img src="../img/be01.jpg" width="650" height="41" border="0"></td></tr>
<tr><td><a href="../about/about.htm"><img src="../img/be02about.jpg" width="94" height="15" border="0"></a><a href="../member/member.htm"><img src="../img/be03member.jpg" width="89" height="15" border="0"></a><a href="mailto:mail@seeds.ca"><img src="../img/be04mail.jpg" width="103" height="15" border="0"></a><img src="../img/be05.jpg" width="364" height="15" border="0"></td></tr>
<tr><td><a href="../news/news.htm"><img src="../img/be06news.jpg" width="94" height="16" border="0"></a><a href="events.htm"><img src="../img/be07events.jpg" width="94" height="16" border="0"></a><a href="../links/links.htm"><img src="../img/be08links.jpg" width="85" height="16" border="0"></a><img src="../img/be09.jpg" width="377" height="16" border="0"></td></tr>
<tr><td><a href="../ff/ff.htm"><img src="../img/be10ff.jpg" width="111" height="16" border="0"></a><a href="../forsale/forsale.htm"><img src="../img/be11sale.jpg" width="101" height="16" border="0"></a><a href="../library/library.htm"><img src="../img/be12library.jpg" width="60" height="16" border="0"></a><img src="../img/be13.jpg" width="378" height="16" border="0"></td></tr>
<tr><td><a href="../en.htm"><img src="../img/be14home.jpg" width="76" height="34" border="0"></a><img src="../img/be15none.jpg" width="307" height="34" border="0"><img src="../img/be16.jpg" width="196" height="34" border="0"><a href="http://www.semences.ca/404.htm"><img src="../img/be17francais.jpg" width="71" height="34" border="0"></a></td></tr>
<tr><td><img src="../img/be18.jpg" width="650" height="9" border="0"></td></tr>
<tr><td align="right"><font face="Arial;Helvetica" size="1"><br><A HREF="../en.htm">Home</A>&nbsp;&gt;&nbsp;<A HREF="events.htm">Seedy Events</A>&nbsp;&gt;&nbsp;Seedy Events October 1999 - February 2000<br><br></font></td></tr>
</table>
</center>


<table width="660" align="center">
<tr><td>
<CENTER><HR WIDTH="50%"><H2><FONT COLOR="007700">Seedy Events October 1999 - February 2000</FONT></H2><HR WIDTH="50%"/></CENTER><P>This is a list of events of interest to members of Seeds of Diversity
        and others interested in plant biodiversity, heritage gardening,
        organic gardening, and seeds. If you know of any other upcoming events,
        please send the information to
        <A HREF="mailto:webmaster@seeds.ca">webmaster@seeds.ca</A>.</P>

<H2>Cedar Lecture at VanDusen Botanical Garden</H2><BLOCKQUOTE><P><B>Vancouver BC, Nov 4 1999</B></P>

<P>On Thursday, November 4, join Hugh Daubeny on an exploration of Exotics
from Down Under, unusual native plants found in Australia and New Zealand.
This entertaining slide presentation will take you on a tour of six botanical
gardens, where you will meet such intriguing residents as bottle brush,
toe toe, and Polutukawa, the New Zealand Christmas tree. Recently retired
from the Pacific Agriculture Research Centre, Hugh is a fellow of the American
Society for Horticultural Science. For more information, contact Garden
Course Co-ordinator, VanDusen Botanical Garden, 5251 Oak Street, Vancouver,
BC V6M 4H1; e-mail
<A HREF="mailto:educate@vandusen.org">educate@vandusen.org</A>.</P>
</BLOCKQUOTE>


<H2>Growing the Organic Market</H2><BLOCKQUOTE><P><B>Guelph ON, Jan 27-30 2000</B></P>

<P>The 19th Annual Organic Conference & Eco-Products Trade Show is
being held on January 27 to 30, 2000 at the University of Guelph. Eliot
Coleman, author of several books and expert market gardener, will deliver
the Saturday keynote on &lsquo;Organic Market Opportunities for the Next 10 Years'
and take part in several other presentations. Barbara Damrosch, author
of several books and TV gardening personality, will participate in workshops.
About 35 speakers will present on introduction to ecological agriculture,
harvest management, organic soil fertility, organic farming and fair trade
and social justice. The Eco-Products Trade Show in the University Centre
runs on Saturday and Sunday.</P>
<P>
For more information, contact Tomas Nimmo, PO Box 116, Collingwood, ON
L9Y 3Z4; e-mail <A HREF="mailto:organix@georgian.net">organix@georgian.net</A>;
or visit <A HREF="http://www.gks.com/OrgConf/">http://www.gks.com/OrgConf/</A></P>
</BLOCKQUOTE>


<H2>Starting a Heritage Vegetable Garden</H2><BLOCKQUOTE><P><B>Toronto ON, Feb 10 2000, 6:30-9:30pm</B></P>

<P>Using seeds passed along by generations
of gardeners, learn about the origins of foods we eat and how to plan your
garden, in your yard, on your balcony, or on your roof. the event takes
place at the Canadian College of Naturopathic Medicine, 1255 Sheppard E.,
Toronto. To register, call 416 498-1255 ext 233.</P>
</BLOCKQUOTE>


<H2>Seeds of Diversity AGM</H2><BLOCKQUOTE><P><B>Montreal QC, Nov 14 1999, 1:00pm</B></P>

<P>Seeds of Diversity Canada is holding its fourth Annual General Meeting
at 1:00 pm on Sunday, November 14, 1999 in Montreal, Quebec. This year,
members attending the AGM will have the opportunity to exchange seeds and
hear our two guest speakers. Yves Gagnon, prominent author and horticulturist,
who appears weekly on national CBC television's "La semaine verte", will
speak on "La production domestique de semences de l&eacute;gumes" (Domestic
production of vegetable seeds). Bob Wildfong, president of SoDC, will also
give a talk on seed sowing techniques. We invite all members to attend
this meeting.</P>
<P>
The AGM will take place at Universit&eacute; du Qu&eacute;bec &agrave;
Montr&eacute;al in conference room RR130, Pavillon Sciences de la Gestion,
315 Ste-Catherine Street East. It is conveniently located in the centre
of Montreal and is close to the Berri-UQAM Metro station.</P>
</BLOCKQUOTE>


<H2>Programme Semencier du Patrimoine assemblée annuelle</H2><BLOCKQUOTE><P><B>Montreal QC, Nov 14 1999, 1:00pm</B></P>

<P>Programme Semencier du Patrimoine tiendra sa quatri&egrave;me assembl&eacute;e
annuelle le dimanche &agrave; 13:00 heures le 14 novembre 1999 &agrave;
Montr&eacute;al, Qu&eacute;bec. Cette ann&eacute;e, en plus de l'agenda
normal, nous offrons l'opportunit&eacute; d'un &eacute;change de semences
entre les membres pr&eacute;sents ainsi que ces conf&eacute;renciers. Yves
Gagnon, auteur r&eacute;put&eacute;, horticulteur et chroniqueur sp&eacute;cialis&eacute;
&agrave; l'&eacute;mission &ldquo; La semaine verte &rdquo; diffus&eacute;e d'un oc&eacute;an
&agrave; l'autre sur les ondes de Radio-Canada, nous pr&eacute;sentera
la conf&eacute;rence "La production domestique de semences de l&eacute;gumes".
Bob Wildfong, pr&eacute;sident de Programme Semencier du Patrimoine,
nous parlera aussi des diff&eacute;rentes techniques de r&eacute;colte
de semences.  Nous invitons tous les membres &agrave; assister &agrave;
cette rencontre.</P>
<P>
Cette rencontre se tiendra &agrave; Universit&eacute; du Qu&eacute;bec
&agrave; Montr&eacute;al, salle de conf&eacute;rence RR130, Pavillon Sciences
de la Gestion, 315, rue Ste-Catherine est. L'endroit est facilement accessible
et pr&egrave;s de la station de M&eacute;tro Berri-UQAM.</P>
</BLOCKQUOTE>


<H2>Garden Talks at the Fredericton Botanic Garden</H2><BLOCKQUOTE><P><B>Fredericton NB, Oct 28 1999, 7pm</B></P>

<P>The Fredericton Botanic Garden Association begins this season's series
of informative garden talks on October 28 at 7 pm at the Garden Resource
Center on Cameron Court off Hanwell Road. </P>
<P>
The first speaker this season will be Daryl Hunter, a member of North American
Fruit Explorers (NAFEX), from Keswick Ridge, N.B. His hobby of 20 years
has been apples, of which he is a collector of historic and modern varieties
- 135 - in fact. His focus is on disease resistance in both historic and
modern varieties, and he is just beginning to work with Kings Landing on
a project to re-establish their orchards. His presentation to us will include
a slide presentation. </P>
</BLOCKQUOTE>


</td></tr></table>

<br><hr><p>Copyright &copy; 2002
<a href="http://www.seeds.ca/">Seeds of Diversity Canada</a>
<br>
</p>
